package robotGame;

/**
 * main - entry point
 */

// Карта с роботами.
// Карта имеет размер nxm, где n и m - положительные целые числа
// Должна быть возможность создания робота на какой-то точке на
// карте
// Координата робота - точка на карте описывается двумя 
// целочисленными координатами.
// Роботы могут перемещаться по карте вперед
// В одной точке не может находится несколько роботов.


/*
* * * * *
* * r * *
* * * * *
* * * * * 
* * * * * 
*/
public class EntryPoint {
    public static void main(String[] args) {
        // RobotMap map = new RobotMap(5, 5);
    }
}